Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མེད་པ་ཡང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཆགས་པ་མེད་དོ།
en: Nonexistent [attainments], up to and including all-aspect omniscience, would also be without attachment to all-aspect omniscience [and so forth].” “

source: གཟུགས་མེད་པ་ཡང་གཟུགས་ལ་ཆགས་པ་མེད་དོ། །ཚོར་བ་མེད་པ་དང་། འདུ་ཤེས་མེད་པ་དང་། འདུ་བྱེད་མེད་པ་དང་། རྣམ་པར་ཤེས་པ་མེད་པ་ཡང་རྣམ་པར་ཤེས་པ་ལ་ཆགས་པ་མེད་དོ།
en: Nonexistent physical forms are without attachment to physical forms, and nonexistent feelings, perceptions, formative predispositions, and consciousness are also without attachment to consciousness [and the other aggregates].

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་མེད་པ་ཡང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་ཆགས་པ་མེད་དོ།
en: Nonexistent [causal attributes], up to and including the factors conducive to enlightenment, are also without attachment to the factors conducive to enlightenment [and so forth].

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པ་ནི། བྱང་ཆུབ་ཀྱི་སེམས་མི་མཉམ་པ་དང་མཉམ་པའི་སེམས། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་མ་ཡིན་པའི་སེམས་དེས་ཀྱང་། ཆོས་ཐམས་ཅད་ལ་ཆགས་པ་མེད་པའི་ཚུལ་གྱིས་རློམ་སེམས་སུ་འགྱུར་བ་མེད་དོ།
en: Venerable Śāradvatīputra, bodhisattva great beings who practice the perfection of wisdom in that manner possess the enlightened mind, the mind that is equal to the unequaled {Dt.175} and not shared in common with the śrāvakas and pratyekabuddhas, but they do not give rise to conceits on that basis because they are without attachment to all phenomena.

source: །མངོན་པར་ཆགས་པར་འགྱུར་བ་མེད་པས། དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བྱའོ།
en: Since they are without fixation, they are called bodhisattva great beings.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་གང་གི་བུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དོན་གང་གི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བགྱི་བ་དེ་ལ།
en: Then the venerable Pūrṇa Maitrāyaṇīputra declared to the Blessed One, “Blessed Lord, I too am inspired to say in what sense bodhisattvas are called great beings.” “

source: བདག་ཀྱང་སྤོབས་པ་སྐྱེའོ།
en: Pūrṇa, be inspired to speak of that!”

source: གང་པོ་ཁྱོད་ཀྱིས་སྤོབས་པ་སྐྱེད་ཅིག །གང་པོས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་གོ་ཆ་ཆེན་པོ་བགོས་པའི་སེམས་ཅན་ལགས་ཏེ།
en: Blessed Lord,” said Pūrṇa, “they are beings who have donned the great armor.

source: བཅོམ་ལྡན་འདས་དེ་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་ཅན་ལགས་ལ།
en: Blessed Lord, they are beings who have entered upon the Great Vehicle.

source: དེ་ནི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་གནས་པའི་སེམས་ཅན་ལགས་པས། དེའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བགྱིའོ།
en: This is why they are called bodhisattva great beings.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་བྱམས་གང་གི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་གང་པོ་ཇི་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གོ་ཆ་ཆེན་པོ་བགོས་ཤེས་བྱ།
en: Then the venerable Śāradvatīputra asked the venerable Pūrṇa Maitrāyaṇīputra, “Venerable Pūrṇa, to what extent are bodhisattva great beings said to don the great armor?” “

source: གང་པོས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་ཉུང་ཟད་ཉི་ཚེ་ཞིག་གི་དོན་དུ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་མ་ཡིན་གྱི། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་ངོ་།
en: Venerable Śāradvatīputra,” replied Pūrṇa, “in this regard, bodhisattva great beings do not maintain the perfection of generosity and offer their gifts for the sake of a small or limited number of beings, but they do practice the perfection of generosity and offer their gifts for the sake of all beings.

source: །སེམས་ཅན་ཉུང་ཟད་ཉི་ཚེའི་ཕྱིར། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཚུལ་ཁྲིམས་སྲུང་བ་མ་ཡིན་གྱི། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: They do not maintain the perfection of ethical discipline and maintain their ethical discipline for the sake of a small or limited number of beings, but they do practice the perfection of ethical discipline and maintain their ethical discipline for the sake of all beings.

source: །སེམས་ཅན་ཉུང་ཟད་ཉི་ཚེའི་ཕྱིར། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བཟོད་པ་སྒོམ་པ་མ་ཡིན་གྱི། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ཏུ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། བཟོད་པ་སྒོམ་མོ།
en: They do not maintain the perfection of tolerance and cultivate tolerance for the sake of a small or limited number of beings, but they do practice the perfection of tolerance and cultivate tolerance for the sake of all beings.

source: །སེམས་ཅན་ཉུང་ཟད་ཉི་ཚེའི་ཕྱིར། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བརྩོན་འགྲུས་རྩོམ་པ་མ་ཡིན་གྱི། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ཏུ། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། བརྩོན་འགྲུས་རྩོམ་མོ།
en: They do not maintain the perfection of perseverance and engage in perseverance for the sake of a small or limited number of beings, but they do practice the perfection of perseverance and engage in perseverance for the sake of all beings.

source: །སེམས་ཅན་ཉུང་ཟད་ཉི་ཚེའི་ཕྱིར། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བསམ་གཏན་སྐྱེད་པ་མ་ཡིན་གྱི། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ཏུ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། བསམ་གཏན་སྐྱེད་དོ།
en: They do not maintain the perfection of meditative concentration and develop meditative concentration for the sake of a small or limited number of beings, but they do practice the perfection of meditative concentration and develop meditative concentration for the sake of all beings.

source: །སེམས་ཅན་ཉུང་ཟད་ཉི་ཚེའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཤེས་རབ་སྒོམ་པ་མ་ཡིན་གྱི། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ཏུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་།
en: They do not maintain the perfection of wisdom and cultivate wisdom for the sake of a small or limited number of beings, but they do practice the perfection of wisdom and cultivate wisdom for the sake of all beings. “

source: ཤེས་རབ་སྒོམ་མོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་འདི་སྙེད་ཅིག་ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་བྱའོ། །སེམས་ཅན་འདི་སྙེད་ཅིག་ནི་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་མི་བྱའོ་ཞེའམ།
en: Bodhisattva great beings do not don their armor for the sake of a finite number of beings, thinking, ‘So many beings will I lead to final nirvāṇa in the expanse of nonresidual nirvāṇa; so many beings will I not lead to final nirvāṇa.

source: སེམས་ཅན་འདི་སྙེད་ཅིག་ནི་བྱང་ཆུབ་ཏུ་དགོད་པར་བྱའོ།
en: So many beings will I establish in enlightenment; so many beings will I not establish [in enlightenment].’

source: །སེམས་ཅན་འདི་སྙེད་ནི་བྱང་ཆུབ་ཏུ་དགོད་པར་མི་བྱའོ་ཞེས་སེམས་ཅན་ཡོངས་སུ་དཔག་པས་གོ་ཆ་མི་གྱོན་གྱི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ཏུ་གོ་ཆ་ཆེན་པོ་གྱོན་ཏོ། །དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་ཀྱང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྦྱར་བར་བྱའོ།
en: Rather, bodhisattva great beings don the great armor for the sake of all beings, thinking, ‘I myself should complete the perfection of generosity, and I should also unite all beings in the perfection of generosity. {

source: །བདག་གིས་ཀྱང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྦྱོར་བར་བྱའོ།
en: Dt.176} I myself should complete the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, and I should also unite all beings in [those perfections, up to and including] the perfection of wisdom.

source: །བདག་ཀྱང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་གནས་པར་བྱའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྦྱར་བར་བྱའོ། །བདག་ཀྱང་རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: I myself should maintain all aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions, and I should also unite all beings in [these causal attributes, up to and including] the formless absorptions.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་གནས་པར་བྱའོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྦྱར་བར་བྱའོ་ཞེས་བྱ་བར་སེམས་སྐྱེད་དེ།
en: I myself should maintain the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the gateways of the meditative stabilities and the dhāraṇīs, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas, and I should also unite all beings in [these fruitional attributes, up to and including] the eighteen distinct qualities of the buddhas.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཙམ་གྱིས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཞེས་བྱའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: Venerable Śāradvatīputra, it is to that extent that bodhisattva great beings are said to don the great armor. “

source: བམ་པོ་བཅུ་བཞི་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྤྱོད་པའི་ཚེ། སྦྱིན་པ་གང་ཡོངས་སུ་གཏོང་བ་དེ་དག་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་ཡོངས་སུ་གཏོང་སྟེ།
en: Moreover, Venerable Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, all the acts of generosity that they undertake are not offered with the considerations of the śrāvakas and pratyekabuddhas, but they are offered through the focusing of their attention with all-aspect omniscience in mind.

source: དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་སྟེ།
en: Making common cause with all beings, they indeed dedicate the roots of their virtuous actions to unsurpassed, complete enlightenment.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of generosity possessed by bodhisattva great beings who practice the perfection of wisdom and offer acts of generosity. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཞིང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སའི་དོན་དུ་ཡོངས་སུ་མི་བསྔོ་བ་འདི་ནི།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings offer their generosity through the focusing of their attention with all-aspect omniscience in mind but do not dedicate it with the aim of the levels of the śrāvakas or pratyekabuddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of ethical discipline possessed by bodhisattva great beings who practice the perfection of wisdom and offer acts of generosity. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཆོས་དེ་དག་ལ་བཟོད་པ་དང་།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind, exhibit endurance, willpower, and reliability with respect to all phenomena.

source: མོས་པ་དང་། རྟེན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of tolerance possessed by bodhisattva great beings who practice the perfection of wisdom and offer acts of generosity. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། བརྩོན་འགྲུས་ཉམ་པར་མི་བྱེད་པ་འདི་ནི།
en: Moreover, Venerable Śāradvatīputra, when bodhisattva great beings offer their generosity, through the focusing of their attention with all-aspect omniscience in mind they do not decline in their perseverance.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of perseverance possessed by bodhisattva great beings who practice the perfection of wisdom and offer acts of generosity. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་ཚེ། འདི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། སེམས་རྩེ་གཅིག་ཏུ་བྱེད་ཅིང་། དེ་ལ་དམིགས་པ་གཅིག་པས་ཉན་ཐོས་དང་།
en: Moreover, Venerable Śāradvatīputra, when bodhisattva great beings offer their generosity, through the focusing of their attention with all-aspect omniscience in mind their minds are one-pointed, with a single focus.

source: རང་སངས་རྒྱས་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་རྣམས་ཀྱི་གོ་མི་འབྱེད་པ་འདི་ནི།
en: Therefore, they do not allow an opportunity for the considerations of the śrāvakas or pratyekabuddhas to develop.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས།
en: This is the armor of the perfection of meditative concentration possessed by bodhisattva great beings who practice the perfection of wisdom and offer acts of generosity. {

source: ཆོས་ཐམས་ཅད་སྒྱུ་མར་བྱས་པའི་འདུ་ཤེས་ཉེ་བར་གནས་ཏེ། སྦྱིན་པ་ཡང་མི་དམིགས། གཏོང་བ་ཡང་མི་དམིགས། ལེན་པ་ཡང་མི་དམིགས་པར། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་།
en: Dt.177} “Moreover, Venerable Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom and offer their generosity, through the focusing of their attention with all-aspect omniscience in mind they maintain the notion that all phenomena are illusory, and do not apprehend the giver, the gift, or the recipient, but, making common cause with all beings, they indeed dedicate the roots of their virtuous actions, without apprehending anything, to unsurpassed, complete enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་བའི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆ་སྟེ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས།
en: This is the armor of the perfection of wisdom possessed by bodhisattva great beings who practice the perfection of wisdom and offer acts of generosity. “

source: ཕ་རོལ་དུ་ཕྱིན་པ་དེ་དག་དང་། སེམས་ཅན་དང་། བྱང་ཆུབ་ལ་མཚན་མར་མི་བྱེད་ཅིང་མི་དམིགས་པ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གི་གོ་ཆ་ཆེན་པོ་བགོས་པར་ཤེས་པར་བྱའོ།
en: Venerable Śāradvatīputra, whenever bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind, neither conceptualize nor apprehend those six perfections, beings, or enlightenment, they do practice the perfection of wisdom and are known to don the great armor of the six perfections possessed by one who practices the perfection of generosity. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། སྦྱིན་པ་གང་ཡོངས་སུ་གཏོང་བ་དེ་དག་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཡོངས་སུ་སྔོ་བ་འདི་ནི།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings who practice the perfection of ethical discipline, through the focusing of their attention with all-aspect omniscience in mind, dedicate all the acts of generosity that they offer for the sake of unsurpassed, complete enlightenment, making common cause with all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of generosity possessed by bodhisattva great beings who practice the perfection of ethical discipline. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལ་ཡང་མོས་པ་མི་སྐྱེད་ན་སོ་སོའི་སྐྱེ་བོའི་ས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་པ་འདི་ནི།
en: Moreover, Venerable Śāradvatīputra, when bodhisattva great beings practice the perfection of ethical discipline, through the focusing of their attention with all-aspect omniscience in mind, they do not hanker for the levels of the śrāvakas or pratyekabuddhas, and much less still for the levels of ordinary people.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of ethical discipline possessed by bodhisattva great beings who practice the perfection of ethical discipline. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind, practice the perfection of ethical discipline and exhibit endurance, willpower, and reliability with respect to all phenomena.

source: ཆོས་དེ་དག་ལ་བཟོད་པ་དང་། མོས་པ་དང་། རྟེན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of tolerance possessed by bodhisattva great beings who practice the perfection of ethical discipline. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། བརྩོན་འགྲུས་ཉམ་པར་མི་བྱེད་པ་འདི་ནི།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind, practice the perfection of ethical discipline and do not degenerate in their perseverance.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of perseverance possessed by bodhisattva great beings who practice the perfection of ethical discipline. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་གནས་པའི་ཚེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སེམས་ཀྱི་གོ་མི་འབྱེད་ཅིང་། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ།
en: Moreover, Venerable Śāradvatīputra, when bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind, practice and maintain the perfection of ethical discipline, they do not allow an opportunity for the mindsets of the śrāvakas or pratyekabuddhas to develop, and, making common cause with all beings, they dedicate the roots of their virtuous actions to unsurpassed, complete enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of meditative concentration possessed by bodhisattva great beings who practice the perfection of ethical discipline. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་སྒྱུ་མར་བྱས་པའི་འདུ་ཤེས་ཉེ་བར་གནས་ཤིང་།
en: Moreover, Venerable Śāradvatīputra, whenever bodhisattva great beings practice the perfection of ethical discipline, not with the considerations of śrāvakas or pratyekabuddhas but through the focusing of their attention with all-aspect omniscience in mind, they maintain the notion that all phenomena are illusory and do not give rise to conceits on the basis of ethical discipline.

source: ཚུལ་ཁྲིམས་དེས་རློམ་སེམས་སུ་མི་བྱེད་དེ། རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཚུལ་ཁྲིམས་དེ་ཡང་མི་དམིགས་ཤིང་། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི།
en: Owing to the emptiness of inherent existence, they do not even apprehend that ethical discipline, but indeed dedicate the roots of their virtuous actions to unsurpassed, complete enlightenment, making common cause with all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of wisdom possessed by bodhisattva great beings who practice the perfection of ethical discipline.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པ་ནི། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་ཐམས་ཅད་ཡོངས་སུ་འཛིན་ཏེ། དེའི་ཕྱིར་གོ་ཆ་ཆེན་པོ་བགོས་ཞེས་བྱའོ།
en: Venerable Śāradvatīputra, bodhisattva great beings who practice the perfection of ethical discipline in that manner are said to don the great armor because they retain all six perfections. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཞིང་དགེ་བའི་རྩ་བ་དེ་ཡང་།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings who practice the perfection of tolerance and are without the considerations of śrāvakas or pratyekabuddhas, offer acts of generosity through the focusing of their attention with all-aspect omniscience in mind, and indeed dedicate the roots of their virtuous actions {Dt.178} for the sake of unsurpassed, complete enlightenment, making common cause with all beings.

source: སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of generosity, possessed by bodhisattva great beings who practice the perfection of tolerance. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཚུལ་ཁྲིམས་ཡོངས་སུ་སྲུང་ཞིང་། དགེ་བའི་རྩ་བ་དེ་ཡང་།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings who practice the perfection of tolerance are without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind they maintain ethical discipline, and indeed dedicate the roots of their virtuous actions to unsurpassed, complete enlightenment, making common cause with all beings.
